//Написать программу вычисления n-ого треугольного числа

package homework;

import java.util.Scanner;

public class ext01 {
    public static void main(String[] args) {
        Scanner iScanner = new Scanner(System.in);
        System.out.println("Введите число- ");
        int a = iScanner.nextInt();
        iScanner.close();
    }
    
}
